# Data frame

1. Creating a data frame
    - Manually
    - From CSV and other files
3. Methods on a data frame
4. `.loc` and `.iloc`
5. `nan` and data frames
6. Boolean indexes and data frames

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]])
df

     0    1    2
0   10   20   30
1   40   50   60
2   70   80   90
3  100  110  120

In [3]:
df.dtypes

0    int64
1    int64
2    int64
dtype: object

In [4]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'))
df

     0    1    2
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [5]:
df = DataFrame([[10, 20, 30],
               [40, 50, 60],
               [70, 80, 90],
               [100, 110, 120]],
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [6]:
# retrieve from a row... using loc/iloc

df.loc['a']

x    10
y    20
z    30
Name: a, dtype: int64

In [7]:
df.iloc[2]

x    70
y    80
z    90
Name: c, dtype: int64

In [8]:
# fancy indexing

df.loc[['a', 'c']]

    x   y   z
a  10  20  30
c  70  80  90

In [9]:
# slice

df.loc['a':'c']

    x   y   z
a  10  20  30
b  40  50  60
c  70  80  90

In [10]:
df.iloc[0:2]

    x   y   z
a  10  20  30
b  40  50  60

In [11]:
# columns -- use []

df['x']

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [12]:
# more than one column

df[['x', 'z']]

     x    z
a   10   30
b   40   60
c   70   90
d  100  120

In [13]:
# watch out -- slices!

df['b':'d']

     x    y    z
b   40   50   60
c   70   80   90
d  100  110  120

In [14]:
df['b':'b']

    x   y   z
b  40  50  60

In [15]:
# we can use dots for columns

df.x

a     10
b     40
c     70
d    100
Name: x, dtype: int64

In [16]:
# general rule: any series method will also work on a data frame,
# and we will get a result for each column

df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [17]:
df['x'].mean()

np.float64(55.0)

In [18]:
df.mean()

x    55.0
y    65.0
z    75.0
dtype: float64

In [19]:
df.std()

x    38.729833
y    38.729833
z    38.729833
dtype: float64

In [20]:
df.min()

x    10
y    20
z    30
dtype: int64

In [22]:
df.mean(axis='columns')

a     20.0
b     50.0
c     80.0
d    110.0
dtype: float64

In [23]:
df['x'].describe()

count      4.000000
mean      55.000000
std       38.729833
min       10.000000
25%       32.500000
50%       55.000000
75%       77.500000
max      100.000000
Name: x, dtype: float64

In [24]:
df.describe()

                x           y           z
count    4.000000    4.000000    4.000000
mean    55.000000   65.000000   75.000000
std     38.729833   38.729833   38.729833
min     10.000000   20.000000   30.000000
25%     32.500000   42.500000   52.500000
50%     55.000000   65.000000   75.000000
75%     77.500000   87.500000   97.500000
max    100.000000  110.000000  120.000000

In [25]:
df['x'] > df['x'].mean()

a    False
b    False
c     True
d     True
Name: x, dtype: bool

In [27]:
# we can use .loc to filter elements with a boolean index
df['x'].loc[   df['x'] > df['x'].mean()   ]

c     70
d    100
Name: x, dtype: int64

In [28]:
# find elements of y where x is greater than the mean
df['y'].loc[   df['x'] > df['x'].mean()   ]

c     80
d    110
Name: y, dtype: int64

In [29]:
# find all rows of df where x > mean
df.loc[   df['x'] > df['x'].mean()   ]

     x    y    z
c   70   80   90
d  100  110  120

In [30]:
# change the index

df

     x    y    z
a   10   20   30
b   40   50   60
c   70   80   90
d  100  110  120

In [31]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [32]:
df.index = ['one', 'two', 'three', 'four']
df

         x    y    z
one     10   20   30
two     40   50   60
three   70   80   90
four   100  110  120

In [33]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [34]:
df.columns = ['col1', 'col2', 'col3']
df

       col1  col2  col3
one      10    20    30
two      40    50    60
three    70    80    90
four    100   110   120

In [35]:
df['col4'] = [11, 12, 13, 14]

In [36]:
df

       col1  col2  col3  col4
one      10    20    30    11
two      40    50    60    12
three    70    80    90    13
four    100   110   120    14

In [37]:
df['col4'] = [110, 120, 130, 140]
df

       col1  col2  col3  col4
one      10    20    30   110
two      40    50    60   120
three    70    80    90   130
four    100   110   120   140

In [38]:
df = DataFrame(np.random.randint(0, 1000, [4, 3]),
              index=list('abcd'),
              columns=list('xyz'))
df

     x    y    z
a  934  178   53
b  153  486  515
c  758  893  113
d  582   51  336

# Exercise: Data frames

1. Create a data frame with random integers from 0-1,000, with 5 rows and 4 columns. Give the rows names of a-e and the columns w-z.
2. Find the mean + std for columns w and y.
3. Find the mean + std + max for rows b, d, and e.
4. Get all rows where y > y.mean().

In [39]:
df = DataFrame(np.random.randint(0, 1000, [5, 4]),
              index=list('abcde'),
              columns=list('wxyz'))
df

     w    x    y    z
a  610   14  753  338
b  686  188  174  411
c  214  711  385  998
d  706  713  311  403
e  249  253  263  903

In [41]:
# 2. Find the mean + std for columns w and y.

df[['w', 'y']].mean()

w    493.0
y    377.2
dtype: float64

In [42]:
df[['w', 'y']].std()

w    241.704365
y    223.607245
dtype: float64

In [47]:
# method chaining

(
    df[['w', 'y']]     # just columns w+y
    .describe()        # run describe
    .loc[['mean', 'std']]    # retreive only mean, std
)

               w           y
mean  493.000000  377.200000
std   241.704365  223.607245

In [49]:
# 3. Find the mean + std + max for rows b, d, and e.

(
    df
    .loc[['b', 'd', 'e']]
    .agg(['mean', 'std', 'max'])
)

               w           x           y           z
mean  547.000000  384.666667  249.333333  572.333333
std   258.269239  286.196320   69.514986  286.393668
max   706.000000  713.000000  311.000000  903.000000

In [50]:
# 4. Get all rows where y > y.mean().

(
    df
    .loc[df['y'] > df['y'].mean()]
)

     w    x    y    z
a  610   14  753  338
c  214  711  385  998

In [51]:
# https://files.lerner.co.il/data-science-exercise-files.zip

In [54]:
filename = 'taxi.csv'

!head $filename

VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954429626464844,40.764141082763672,1,N,-73.974754333496094,40.754093170166016,2,17,0,0.5,0,0,0.3,17.8
2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,.46,-73.971443176269531,40.758941650390625,1,N,-73.978538513183594,40.761909484863281,1,6.5,0,0.5,1,0,0.3,8.3
2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,.87,-73.978111267089844,40.738433837890625,1,N,-73.990272521972656,40.745437622070313,1,8,0,0.5,2.2,0,0.3,11
2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892333984375,40.773529052734375,1,N,-73.971527099609375,40.760330200195312,1,13.5,0,0.5,2.86,0,0.3,17.16
1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979087829589844,40.776771545410156,1,N,-73.982162475585937,40.758998870849609,2,9.5,0,0.5,0,0,0.3,10.3
1,2015-06-02 11:19:33,2015-06-02 11:28:48,1,1.40,-73.94464111328125,40.779464721679688,1,N,-73.96136474609375,40.771560668945313,1,8,0,0.5,1.75,0,0.3,10.55
1,2015-06-02 11:19:34,2015-06-02 11:38:46,1,1.80,-73.992866516113281,40.748210906982422,1,N,-73.969772338867187,40.748458862304687,1,12.5,0,0.5,3,0,0.3,16.3
1,2015-06-02 11:19:35,2015-06-02 12:36:46,4,11.90,-73.863075256347656,40.769252777099609,1,N,-73.986709594726563,40.761306762695313,1,52.5,0,0.5,15,5.54,0.3,73.84
2,2015-06-02 11:19:36,2015-06-02 11:45:19,1,1.27,-73.991432189941406,40.749305725097656,1,N,-73.985061645507813,40.759525299072266,2,15,0,0.5,0,0,0.3,15.8

In [55]:
df = pd.read_csv(filename)

In [56]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,2,2015-06-02 11:19:29,2015-06-02 11:47:52,1,1.63,-73.954430,40.764141,1,N,-73.974754,40.754093,2,17.0,0.0,0.5,0.00,0.0,0.3,17.80
1,2,2015-06-02 11:19:30,2015-06-02 11:27:56,1,0.46,-73.971443,40.758942,1,N,-73.978539,40.761909,1,6.5,0.0,0.5,1.00,0.0,0.3,8.30
2,2,2015-06-02 11:19:31,2015-06-02 11:30:30,1,0.87,-73.978111,40.738434,1,N,-73.990273,40.745438,1,8.0,0.0,0.5,2.20,0.0,0.3,11.00
3,2,2015-06-02 11:19:31,2015-06-02 11:39:02,1,2.13,-73.945892,40.773529,1,N,-73.971527,40.760330,1,13.5,0.0,0.5,2.86,0.0,0.3,17.16
4,1,2015-06-02 11:19:32,2015-06-02 11:32:49,1,1.40,-73.979088,40.776772,1,N,-73.982162,40.758999,2,9.5,0.0,0.5,0.00,0.0,0.3,10.30

In [57]:
df.describe()

,VendorID,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RateCodeID,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
count,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000,9999.000000
mean,1.516652,1.659466,3.158511,-73.014956,40.226521,1.045105,-73.054699,40.248644,1.407741,14.415892,0.118212,0.497450,1.818059,0.400433,0.299790,17.552472
std,0.499748,1.333306,4.037516,8.347871,4.599169,0.302132,8.186847,4.510520,0.501911,12.442624,0.214794,0.037667,2.634469,1.665170,0.010816,15.137990
min,1.000000,0.000000,0.000000,-74.186302,0.000000,1.000000,-74.277367,0.000000,1.000000,-7.000000,-0.500000,-0.500000,0.000000,0.000000,-0.300000,-7.800000
25%,1.000000,1.000000,1.000000,-73.990997,40.738556,1.000000,-73.990261,40.738478,1.000000,7.000000,0.000000,0.500000,0.000000,0.000000,0.300000,8.800000
50%,2.000000,1.000000,1.700000,-73.979774,40.755909,1.000000,-73.978256,40.756340,1.000000,10.500000,0.000000,0.500000,1.000000,0.000000,0.300000,12.800000
75%,2.000000,2.000000,3.300000,-73.963001,40.770012,1.000000,-73.961311,40.771044,2.000000,17.000000,0.000000,0.500000,2.460000,0.000000,0.300000,19.800000
max,2.000000,6.000000,64.600000,0.000000,41.064606,5.000000,0.000000,41.137344,4.000000,250.000000,1.000000,0.500000,42.050000,70.000000,0.300000,252.350000